'''
有一个函数triangles()，能打印出，请使用生成器完成，
[1]
[1, 1]
[1, 2, 1]
[1, 3, 3, 1]
[1, 4, 6, 4, 1]
[1, 5, 10, 10, 5, 1]
[1, 6, 15, 20, 15, 6, 1]
[1, 7, 21, 35, 35, 21, 7, 1]
[1, 8, 28, 56, 70, 56, 28, 8, 1]
[1, 9, 36, 84, 126, 126, 84, 36, 9, 1]
'''
def triangles(n):
    l=[[1],[1,1]]
    for i in range(2,n):
        x=l[-1]
        l2=[1]*(i+1)
        for j in range(i//2):
            l2[j+1]=x[j]+x[j+1]
            if i!=2j:
                l2[-j-2]=l2[i+1]
                l.append(l2)
    print(l)
triangles(6)