# coding=utf-8

'''
第七题：打印大X
题目描述
小明希望用星号拼凑，打印出一个大X，他要求能够控制笔画的宽度和整个字的高度。
为了便于比对空格，所有的空白位置都以句点符来代替。

要求输入两个整数m n，表示笔的宽度，X的高度。用空格分开(0<m<n, 3<n<1000, 保证n是奇数)
要求输出一个大X

例如，用户输入：
3 7
程序应该输出：
***...***
.***.***.
..*****..
...***...
..*****..
.***.***.
***...***
再例如，用户输入：
4 21
程序应该输出
****................****
.****..............****.
..****............****..
...****..........****...
....****........****....
.....****......****.....
......****....****......
.......****..****.......
........********........
.........******.........
..........****..........
.........******.........
........********........
.......****..****.......
......****....****......
.....****......****.....
....****........****....
...****..........****...
..****............****..
.****..............****.
****................****
'''
# (思路：我将X分为三部分，上部分得V型，中间部分，下部分得倒v型，然后每行分为5部分，
# 分别为'.'部分，'*'部分，'.'部分，'*'部分，'.'部分，最后用循环分别打出来就可以了)
m,n=map(int,input().split(' '))
x='*'*m
a,c,d=0,n,2
if n%2==1:
    while c>0:
        b=n-m-1-2*a
        if b>0:
            print('%s%s%s%s%s'% ('.'*a,x,'.'*b,x,'.'*a))
        elif b<=0:
            if (2*m+b)>=m:
                print('%s%s%s'% ('.'*a,'*'*(2*m+b),'.'*a))
            elif abs(b)<=2*m:
                print('%s%s%s'% ('.'*(a-d),'*'*abs(b),'.'*(a-d)))
                d+=2
            elif abs(b)>2*m:
                print('%s%s%s%s%s'% ('.'*(a-d),x,'.'*abs(2*m+b),x,'.'*(a-d)))
                d+=2
        a+=1
        c-=1
else:
    print('高度不为‘奇数’\n就为下列样式：')
    while (c-1)>0:
        b=n-2*a-2
        if b>0:
            print('%s%s%s%s%s'% ('.'*a,x,'.'*b,x,'.'*a))
        elif b<=0:
            if b==0:
                print('%s%s%s'% ('.'*a,'*'*(2*m),'.'*a))
                print('%s%s%s'% ('.'*a,'*'*(2*m),'.'*a))
            elif abs(b)>0:
                print('%s%s%s%s%s'% ('.'*(a-d),x,'.'*abs(b),x,'.'*(a-d)))
                d+=2
        a+=1
        c-=1