# coding=utf-8
'''输入：points = [[1,1],[3,4],[-1,0]]
输出：7
解释：一条最佳的访问路径是： [1,1] -> [2,2] -> [3,3] -> [3,4] -> [2,3] -> [1,2] -> [0,1] -> [-1,0]   
从 [1,1] 到 [3,4] 需要 3 秒 
从 [3,4] 到 [-1,0] 需要 4 秒
一共需要 7 秒
示例 2：

输入：points = [[3,2],[-2,2]]
输出：5
'''
print()
print('注意：输入的点的格式为：[[x1,y1],[x2,y2],[x3,y3]...]，行走的过程是以你输入的点的先后顺序')
print()
x=eval(input('输入你想知道的那几个点的最短行走时间:'))
print()
# print(x)
# print(type(x))
m=len(x)
k=0
# print(m)
# print(x[m-1])
while m>1:
    n=abs(abs(x[m-1][0]-x[m-2][0])-abs(x[m-1][1]-x[m-2][1]))+min(abs(x[m-1][0]-x[m-2][0]),abs(x[m-1][1]-x[m-2][1]))
    m-=1
    k+=n
print('最短路径走的时间为：%s秒' % k)