# coding=utf-8

'''
第六题：等腰三角形
题目描述
本题目要求你在控制台输出一个由数字组成的等腰三角形。
具体的步骤是：
1. 先用1,2,3，...的自然数拼一个足够长的串
2. 用这个串填充三角形的三条边。从上方顶点开始，逆时针填充。
比如，当三角形高度是8时：

       1
      2 1
     3   8
    4     1
   5       7
  6         1
 7           6
891011121314151

显示不正确时，参看：p1.png

输入，一个正整数n(3<n<300),表示三角形的高度
输出，用数字填充的等腰三角形。

为了便于测评，我们要求空格一律用"."代替。

例如：
输入：
5

程序应该输出：
....1
...2.1
..3...2
.4.....1
567891011

再例如：
输入：
10

程序应该输出：
.........1
........2.2
.......3...2
......4.....2
.....5.......1
....6.........2
...7...........0
..8.............2
.9...............9
1011121314151617181

再例如：
输入：
15

程序应该输出：

..............1
.............2.3
............3...2
...........4.....3
..........5.......1
.........6.........3
........7...........0
.......8.............3
......9...............9
.....1.................2
....0...................8
...1.....................2
..1.......................7
.1.........................2
21314151617181920212223242526
'''
# (思路：把我需要的转换为字符串，然后根据情况打印出来就可以了)
x=int(input())
n=''
for i in range(1,3*x):
    n+=str(i)
n=n[:(4*(x-1))]
# print(n)
y=1
while y<=x:
    if y==1:
        print('%s%s'% ('.'*(x-1),n[0]))
        n=n[1:]
    elif y==x:
        print(n)
    else:
        print('%s%s%s%s'% ('.'*(x-y),n[0],'.'*(2*y-3),n[-1]))
        n=n[1:-1]
    y+=1



'''这是别人完成的'''
# x=int(input())
# s=''
# for i in range(1,3*x):
#     s+=str(i)
# print('.'*(x-1)+s[0])
# x1, n,m= x - 2, 1,4*x-5
# while x1>0:
#     print('.'*x1+s[n]+'.'*(2*n-1)+s[m])
#     x1-=1
#     n+=1
#     m-=1
# print(s[x-1:3*x-2])