'''
我们定义「顺次数」为：每一位上的数字都比前一位上的数字大 1 的整数。

请你返回由 [low, high] 范围内所有顺次数组成的 有序 列表（从小到大排序）。



示例 1：

输出：low = 100, high = 300
输出：[123,234]
示例 2：

输出：low = 1000, high = 13000
输出：[1234,2345,3456,4567,5678,6789,12345]
'''

# def shunxushu(low,high):
#     l = []
#     for n in range(low,high+1):
#         a = str(n)[0]
#         while len(str(n)) > len(a) and int(a[-1]) < 9:
#             a += str(int(a[-1]) + 1)
#         if int(a) == n:
#             l.append(n)
#     return l
# print(shunxushu(10,100000))

def sec(low,high):
    l = [12,23,34,45,56,67,78,89,123,234,345,456,567,678,789,1234,2345,3456,4567,5678,6789,12345,23456,34567,45678,56789,123456,234567,345678,456789,1234567,2345678,3456789,12345678,23456789,123456789]
    l2 = []
    for i in l:
        if i>= low and i<=high+1:
            l2.append(i)
        return l2
print(sec(10,100000000))