# 10.土地测量
# 造成高房价的原因有许多，比如土地出让价格。既然地价高，土地的面积必须仔细计算。遗憾的是，有些地块的形状不规则，比如是如图【1.jpg】中所示的五边形。
# 一般需要把它划分为多个三角形来计算。
# 已知三边求三角形的面积需要用海伦定理，参见【2.jpg】
# 各条边长数据如下：
# AB = 52.1
# BC = 57.2
# CD = 43.5
# DE = 51.9
# EA = 33.4
# EB = 68.2
# EC = 71.


#>>>>>>>>>>>>方法一
def hailun(a,b,c):
    p=(a+b+c)/2
    S=(p*(p-a)*(p-b)*(p-c))**(1/2)
    return S
S1=hailun(52.1,33.4,68.2)
S2=hailun(68.2,57.2,71.9)
S3=hailun(71.9,43.5,51.9)
print(S1+S2+S3)

#>>>>>>>>>>>方法二
def sq(a,b,c):
    s = (a+b+c)/2
    d = (s*(s-a)*(s-b)*(s-c))**(1/2)
    return d
s = sq(52.1,33.4,68.2)+sq(57.2,68.2,71.9)+sq(71.9,51.9,43.5)
print('%.2f'%s)